Repository: abm4450/cw-flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Welcome
ar: مرحباً

# tagline
source: The fastest, cleanest, smartest wash in town.
ar: أسرع وأنظف وأذكى غسيل في المدينة.

# login
source: Customer Login
ar: دخول العملاء

# register
source: New Membership
ar: عضوية جديدة

# admin
source: Admin Portal
ar: بوابة المسؤول

# mobile
source: Mobile Number
ar: رقم الجوال

source: Full Name
ar: الاسم الكامل

# plate
source: Car Plate Number
ar: رقم لوحة السيارة

# submit
source: Continue
ar: استمرار

# myCard
source: My Membership Card
ar: بطاقة العضوية الخاصة بي

# washCounter
source: Wash Progress
ar: تقدم الغسيل

# progressMsg
source: Remaining for your gift..
ar: متبقي على هديتك..

# freeNextMsg
source: Your next wash is on us
ar: غسلتك الجاية علينا

# scanned
source: Scan complete!
ar: تم المسح بنجاح!

source: Total Washes
ar: إجمالي الغسلات

source: Member ID
ar: رقم العضوية

# registerWash
source: Register New Wash
ar: تسجيل غسلة جديدة

# adminDashboard
source: Control Center
ar: مركز التحكم

# scanBarcode
source: Quick Scan
ar: مسح سريع

# logout
source: Sign Out
ar: تسجيل الخروج

source: Total Members
ar: إجمالي الأعضاء

# freeWashAlert
source: CONGRATULATIONS! This wash is FREE!
ar: مبروك! هذا الغسيل مجاني!

# paidWashAlert
source: Paid wash registered successfully.
ar: تم تسجيل الغسلة المدفوعة بنجاح.

# aiInsights
source: Smart Business Assistant
ar: مساعد الأعمال الذكي

source: Back
ar: رجوع

# hello
source: Hi
ar: مرحباً

source: Overview
ar: نظرة عامة

# members
source: Members Directory
ar: دليل الأعضاء

# activity
source: Recent Activity
ar: آخر النشاطات

# searchPlaceholder
source: Search by name or plate...
ar: ابحث بالاسم أو اللوحة...

# noMembers
source: No members found.
ar: لا يوجد أعضاء.

source: Exclusive Member
ar: عضوية حصرية

source: Level 1
ar: المستوى ١

# plateNumberLabel
source: Plate Number
ar: رقم اللوحة

source: Points Earned
ar: النقاط المكتسبة

source: Scan at counter
ar: امسح الكود عند المحاسب

source: Verified ID
ar: هوية موثقة

source: Wash History
ar: سجل الغسلات

# noHistory
source: No history recorded yet.
ar: لا يوجد غسلات مسجلة حتى الآن.

# paidStatus
source: Paid Wash
ar: غسلة مدفوعة

# freeStatus
source: Free Reward
ar: مكافأة مجانية

# analyzing
source: Analyzing Business Data...
ar: جاري تحليل البيانات...

# quietDay
source: Quiet Day So Far
ar: يوم هادئ حتى الآن

# activityModal
source: Activity
ar: النشاط

# statusModal
source: Status
ar: الحالة

source: NEXT FREE
ar: الغسلة القادمة مجانية

source: Redeem Reward
ar: استخدام المكافأة

# washesCount
source: Washes
ar: غسلات

source: Gift
ar: هدية

source: Paid
ar: مدفوعة

source: Secret Key
ar: الرمز السري

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# hasAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Register Now
ar: سجل الآن

source: Sign In
ar: سجل دخول

# confirm
source: Confirmed
ar: تم التأكيد

source: Cancel
ar: إلغاء

source: Confirm Scan
ar: تأكيد قراءة الباركود

# undoWash
source: Undo Last Wash
ar: تراجع عن آخر غسلة

# undoSuccess
source: Last wash undone
ar: تم التراجع عن آخر غسلة

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Save
ar: حفظ

source: Saved
ar: تم الحفظ

source: Deleted
ar: تم الحذف

source: Edit Member
ar: تعديل العضو

# deleteConfirm
source: Delete this member?
ar: هل تريد حذف هذا العضو؟

source: Gifts Ready
ar: الهدايا الجاهزة

source: Last wash
ar: آخر غسلة

source: Member since
ar: عضو منذ

# filterAll
source: All
ar: الكل

# filterGifts
source: Gifts
ar: الهدايا

# filterNew
source: New
ar: جدد

# filterInactive
source: Inactive
ar: بدون نشاط

# filterPaid
source: Paid
ar: مدفوعة

# filterFree
source: Free
ar: هدية

# sortRecent
source: Recent
ar: الأحدث

# sortName
source: Name
ar: الاسم

# sortWashes
source: Washes
ar: الغسلات

source: Top member
ar: الأكثر نشاطًا

source: Quick filters
ar: فلاتر سريعة

source: Clear activity
ar: مسح آخر النشاطات

# clearActivityConfirm
source: Clear recent activity?
ar: مسح آخر النشاطات؟

source: Cleared
ar: تم المسح

# appName
source: Washing Circle
ar: دائرة الغسيل

source: Password
ar: كلمة المرور
